app/Http/Controllers/User/BillPayController.php

select * from `ck_transactions` where `user_id` = 1 and `type` = 'airtime' order by `created_at` desc
---
    public function ckAirtime()
    {
        $networks = (new CkHelper())->getMobileNetworks();
        $user = userGuard()['user'];
        $userWallet = UserWallet::where('user_id', $user->id)
            ->whereHas("currency", function ($q) {
                $q->where("code", "NGN")->active();
            })
            ->active()
            ->first();
        $transactions = CkTransaction::where('user_id', $user->id)
            ->where('type', 'airtime')
            ->latest()
            ->get();

select * from `ck_transactions` where `user_id` = 1 and `type` = 'data' order by `created_at` desc
---
    public function ckData()
    {
        $networks = (new CkHelper())->getMobileNetworks();
        $user = userGuard()['user'];
        $transactions = CkTransaction::where('user_id', $user->id)
            ->where('type', 'data')
            ->latest()
            ->get();

select * from `ck_mobile_networks` where `ck_mobile_networks`.`id` = '4' limit 1
select * from `ck_data_plans` where `ck_data_plans`.`id` = '95' limit 1
---
        | GET NETWORK & DATA PLAN
        |--------------------------------------------------------------------------
        */
        $network = CkMobileNetwork::findOrFail($request->network_id);
        $plan    = CkDataPlan::findOrFail($request->plan_id);

update `user_wallets` set `balance` = 8964099.405248, `user_wallets`.`updated_at` = '2025-12-28 19:24:15' where `id` = 6
---
            |--------------------------------------------------------------------------
            */
            $userWallet->balance -= $payable;
            $userWallet->save();

update `user_wallets` set `balance` = 8964099.405248, `user_wallets`.`updated_at` = '2025-12-28 20:29:25' where `id` = 6
---

                // Refund wallet
                $userWallet->balance += $payable;
                $userWallet->save();

insert into `ck_transactions` (`user_id`, `request_id`, `order_id`, `provider`, `type`, `network`, `plan`, `amount`, `mobile`, `status`, `response_body`, `updated_at`, `created_at`) values (1, '', '', 'ClubKonnect', 'data', 'Airtel', '1GB - 1 day (Awoof Data)', 541.16865, '08127460133', 'INSUFFICIENT_BALANCE', '\"{\\"status\\":\\"INSUFFICIENT_BALANCE\\"}\"', '2025-12-28 20:29:25', '2025-12-28 20:29:25')
---
            | SAVE TRANSACTION
            |--------------------------------------------------------------------------
            */
            $transaction = CkTransaction::create([
                'user_id'       => $user->id,
                'request_id'    => $response['RequestID'] ?? null,
                'order_id'      => $response['OrderID'] ?? null,
                'provider'      => "ClubKonnect",
                'type'          => 'data',
                'network'       => $network->name,
                'plan'          => $plan->description,
                'amount'        => $payable,
                'mobile'        => $request->mobile,
                'status'        => $response['status'],
                'response_body' => json_encode($response)
            ]);

select * from `ck_mobile_networks` where `ck_mobile_networks`.`id` = '4' limit 1
---
        }

        // Get selected network
        $network = CkMobileNetwork::findOrFail($request->network_id);

update `user_wallets` set `balance` = 8964018.905248, `user_wallets`.`updated_at` = '2026-01-01 13:22:29' where `id` = 6
---

            if ($walletDebit > 0) {
                $userWallet->balance -= $walletDebit;
                $userWallet->save();

update `user_wallets` set `balance` = 8964018.905248, `user_wallets`.`updated_at` = '2026-01-01 11:37:45' where `id` = 6
---

            if ($cashbackToUse > 0) {
                $userWallet->cashback -= $cashbackToUse;
                $userWallet->save();

update `user_wallets` set `balance` = 8964099.405248, `user_wallets`.`updated_at` = '2026-01-01 11:37:46' where `id` = 6
---
                // Refund Wallet on Failure
                if ($walletDebit > 0) {
                    $userWallet->balance += $walletDebit;
                    $userWallet->save();