app/Http/Controllers/User/DashboardController.php

select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 5
select * from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'RECEIVED' and `status` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'SEND' and `status` = 1 order by `id` desc
select * from `transactions` where `user_id` = 1 and `type` = 'BILL-PAY' and `status` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'MOBILE-TOPUP' and `status` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `status` = 1
select count(*) as aggregate from `gift_cards` where `user_id` = 1
select sum(`cashback`) as aggregate from `user_wallets` where `user_id` = 1
---
    public function index()
    {
        $page_title = __('Dashboard');
        $baseCurrency = Currency::default();
        $transactions = Transaction::auth()->latest()->take(5)->get();
        $data['totalReceiveRemittance'] = amountOnBaseCurrency(Transaction::auth()->remitance()->where('attribute', 'RECEIVED')->where('status', 1)->get());
        $data['totalSendRemittance'] = amountOnBaseCurrency(Transaction::auth()->remitance()->where('attribute', 'SEND')->where('status', 1)->orderBy('id', 'DESC')->get());
        $data['cardAmount'] = virtualCardAmountOnBaseCurrency(userActiveCardData()['total_cards']);
        $data['billPay'] = amountOnBaseCurrency(Transaction::auth()->billPay()->where('status', 1)->get());
        $data['topUps'] = amountOnBaseCurrency(Transaction::auth()->mobileTopup()->where('status', 1)->get());
        $data['withdraw'] = amountOnBaseCurrency(Transaction::auth()->moneyOut()->where('status', 1)->get());
        $data['total_transaction'] = Transaction::auth()->where('status', 1)->count();
        $data['total_gift_cards'] = GiftCard::auth()->count();
        $data['total_cashback'] = UserWallet::auth()->sum('cashback');

select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2026-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2026-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2026-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2026-01-01' and `status` = 3
---
            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();

select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2026-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2026-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2026-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2026-01-01' and `status` = 3
---
            $hold_data[] = $hold;

            // Monthley money Out
            $money_pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $money_success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $money_canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $money_hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();