app/Http/Helpers/helpers.php

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 5
---
function get_user_notifications()
{
    if (auth()->guard('web')->check()) {
        $notifications = UserNotification::auth()->latest()->take(5)->get();

select * from `languages` where `status` = 1 limit 1
---
function selectedLang()
{
    $default_language = Language::where('status', GlobalConst::ACTIVE)->first();

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir()
{
    if (session()->get('local')) {
        $default_language = Language::where('code', session()->get('local'))->first();
        $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    } else {
        $default_language = Language::where('status', GlobalConst::ACTIVE)->first();

select * from `module_settings` where `slug` = 'mobile-top-up' limit 1
---
function module_access($key, $module = null)
{
    if (! $module) {
        $module = ModuleSetting::query();
    }

    return $module->where('slug', $key)->first();

select * from `virtual_card_apis` limit 1
---
function virtual_card_system($name)
{
    $method = VirtualCardApi::first();

select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 1
select count(*) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 0
select sum(`balance`) as aggregate from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 1
select * from `strowallet_virtual_cards` where `user_id` = 1 and `is_active` = 1
---
function userActiveCardData()
{
    if (virtual_card_system('flutterwave') == 'flutterwave') {
        $virtual_cards = VirtualCard::where('user_id', auth()->user()->id)->count();
        $active_cards = VirtualCard::where('user_id', auth()->user()->id)->where('is_active', 1)->count();
        $inactive_cards = VirtualCard::where('user_id', auth()->user()->id)->where('is_active', 0)->count();
        $total_balance = VirtualCard::where('user_id', auth()->user()->id)->where('is_active', 1)->sum('amount');
        $total_cards = VirtualCard::where('user_id', auth()->user()->id)->where('is_active', 1)->get();
    } elseif (virtual_card_system('sudo') == 'sudo') {
        $virtual_cards = SudoVirtualCard::where('user_id', auth()->user()->id)->count();
        $active_cards = SudoVirtualCard::where('user_id', auth()->user()->id)->where('status', 1)->count();
        $inactive_cards = SudoVirtualCard::where('user_id', auth()->user()->id)->where('status', 0)->count();
        $total_balance = SudoVirtualCard::where('user_id', auth()->user()->id)->where('status', 1)->sum('amount');
        $total_cards = SudoVirtualCard::where('user_id', auth()->user()->id)->where('status', 1)->get();
    } elseif (virtual_card_system('stripe') == 'stripe') {
        $virtual_cards = StripeVirtualCard::where('user_id', auth()->user()->id)->count();
        $active_cards = StripeVirtualCard::where('user_id', auth()->user()->id)->where('status', 1)->count();
        $inactive_cards = StripeVirtualCard::where('user_id', auth()->user()->id)->where('status', 0)->count();
        $total_balance = StripeVirtualCard::where('user_id', auth()->user()->id)->where('status', 1)->sum('amount');
        $total_cards = StripeVirtualCard::where('user_id', auth()->user()->id)->where('status', 1)->get();
    } elseif (virtual_card_system('strowallet') == 'strowallet') {
        $virtual_cards = StrowalletVirtualCard::where('user_id', auth()->user()->id)->count();
        $active_cards = StrowalletVirtualCard::where('user_id', auth()->user()->id)->where('is_active', 1)->count();
        $inactive_cards = StrowalletVirtualCard::where('user_id', auth()->user()->id)->where('is_active', 0)->count();
        $total_balance = StrowalletVirtualCard::where('user_id', auth()->user()->id)->where('is_active', 1)->sum('balance');
        $total_cards = StrowalletVirtualCard::where('user_id', auth()->user()->id)->where('is_active', 1)->get();

select * from `reloadly_apis` where `provider` = 'CLUBKONNECT' and `status` = 1 and `type` = 'UTILITY' limit 1
select * from `reloadly_apis` where `provider` = 'RELOADLY' and `status` = 1 and `type` = 'UTILITY-PAYMENT' limit 1
---
function active_billpay_provider()
{
    // Check ClubKonnect
    $ck = ReloadlyApi::where('provider', ReloadlyApi::PROVIDER_CLUBKONNECT)
        ->where('status', 1)
        ->where('type', ReloadlyApi::UTILITY)
        ->first();

    // Check Reloadly
    $reloadly = ReloadlyApi::where('provider', ReloadlyApi::PROVIDER_RELOADLY)
        ->where('status', 1)
        ->where('type', ReloadlyApi::UTILITY_PAYMENT)
        ->first();