app/Http/Middleware/Admin/Localization.php

select * from `languages` where `status` = 1 limit 1
---
    public function handle(Request $request, Closure $next)
    {
        try {
            $default_language = Language::where('status', GlobalConst::ACTIVE)->first();