app/Models/Admin/Currency.php

    public function scopeDefault()
    {
        return $this->where('default', true)->first() ?? false;
---
select * from `currencies` where `default` = 1 limit 1