app/Traits/User/LoggedInUsers.php

    protected function createLoginLog($user)
    {
        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);

        $agent = new Agent;

        // $mac = exec('getmac');
        // $mac = explode(" ",$mac);
        // $mac = array_shift($mac);
        $mac = '';

        $data = [
            'user_id' => $user->id,
            'ip' => $client_ip,
            'mac' => $mac,
            'city' => $location['city'] ?? '',
            'country' => $location['country'] ?? '',
            'longitude' => $location['lon'] ?? '',
            'latitude' => $location['lat'] ?? '',
            'timezone' => $location['timezone'] ?? '',
            'browser' => $agent->browser() ?? '',
            'os' => $agent->platform() ?? '',
        ];

        try {
            UserLoginLog::create($data);
---
insert into `user_login_logs` (`user_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`, `updated_at`, `created_at`) values (1, '127.0.0.1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'OS X', '2026-01-01 11:37:24', '2026-01-01 11:37:24')