app/Traits/User/UserPartials.php

select * from `user_qr_codes` where `user_qr_codes`.`user_id` = 1 and `user_qr_codes`.`user_id` is not null limit 1
---
    public function createQr()
    {
        $user = $this->user();
        $qrCode = $user->qrCode()->first();