app/Http/Helpers/Clubkonnect/CkHelper.php

    public function getMobileNetworks()
    {
        return CkMobileNetwork::orderBy('name')->get();
---
select * from `ck_mobile_networks` order by `name` asc

    public function getDataPlansByNetwork($networkId)
    {
        // Fetch network
        $network = CkMobileNetwork::findOrFail($networkId);

        // Fetch ClubKonnect settings
        $api = ReloadlyApi::clubkonnect()->utility()->first();
        if (!$api) {
            return response()->json([]);
        }
        // Get network-specific data categories from credentials
        $enabledCategories = [];
        $networks = $api->credentials->networks ?? [];

        if ($networks && isset($networks->{$network->slug}->data_categories)) {
            foreach ($networks->{$network->slug}->data_categories as $cat) {
                if (!empty($cat->status)) {
                    $enabledCategories[] = strtolower($cat->label);
                }
            }
        }

        // Fetch plans for the network
        $plans = CkDataPlan::where('ck_mobile_network_id', $networkId)->orderBy('price')->get();
---
select * from `ck_mobile_networks` where `ck_mobile_networks`.`id` = '2' limit 1
select * from `ck_data_plans` where `ck_mobile_network_id` = '2' order by `price` asc